{
  "main.title": "Welcome on my website !",
  "main.body": "Welcome to <a class=hyperlink href=\".\">rewan.dev</a>. This website is my personal virtual space, where I can record my <a class=hyperlink href=\"/career\">developer profile</a>, my personal <a class=hyperlink href=\"/projects\">projects</a>, and <a class=hyperlink href=\"/contact\">contact</a> information. You can access these categories respectively via the topbar icons.<br>This website is totally responsive for phones, tablets and computers, and is available in English and French languages.<br>More information about this website are available in the \"about this website\" section.",
  "me": "About me",
  "me.more": "More information <a class=hyperlink href=\"/career\">here</a>.",
  "website.title": "About this website",
  "website.body": "This website uses HTML5/CSS3 and JavaScript with the help of Twitter's <a class=\"hyperlink\" href=\"/about/bootstrap\">Bootstrap 4</a> framework as well as a MVC <a class=\"hyperlink\" href=\"/about/go\">Go</a> architecture thanks to the <a class=\"hyperlink\" href=\"/about/gin\">Gin Gonic</a> framework which allows a better management of HTTP requests.<br>The website used to run with Java on <a class=\"hyperlink\" href=\"/about/play\">Play! framework</a> version 1.5 > <a class=\"hyperlink\" href=\"/about/2.0\">Why did it change ?</a><br>The SSL certificate allowing access to the HTTPS protocol is provided by <a class=\"hyperlink\" href=\"/about/letsencrypt\">Let's Encrypt</a>.<br>The hosting of the domain and of the Debian machine is provided by <a class=\"hyperlink\" href=\"/about/gandi\">Gandi</a>.",

  "career.main.title": "Who am I ?",
  "career.main.body": "Hello ! My name is Erwan Le Bihan, <a class=\"hyperlink\" href=\"../tools/time\">I am {{.param}}</a> and I am an IT developer and engineer <a class=\"hyperlink\" href=\"/about/rouen\">living in Rouen</a>, but an artist above all else. I am passionate about technology and art since childhood and notably by video game creation, even if I recently went interested by web and apps development. I consider programming as an art of its own, and what I want above all else is to like what I do - My philosophy is to always listen my heart when making professional choices and personal projects.",
  "career.skills.legend.os": "Familiar with the major systems",
  "career.skills.legend.formats": "I develop for all devices",
  "career.skills.legend.present": "My skills, by category :",
  "career.skills.title": "My skills",
  "career.skills.body.ide": "IntelliJ, Unity, Eclipse, Visual Studio, Sublime Text, Nano",
  "career.skills.body.db": "SQL, MySQL, MongoDB, PHPMyAdmin, Access, SQL Server",
  "career.skills.body.git": "Git, Github, GitLab, BitBucket, GitKraken, SourceTree, Working Copy",
  "career.skills.body.pm": "Agiles Methods, Trello, Project, Ganttproject, OBS/WBS, Mind Mapping, UML, Monday",
  "career.skills.body.design": "Aseprite, Inkscape, MagicaVoxel (Pixel / Voxel and Vector art)",
  "career.skills.body.desk": "LaTeX, Word, PowerPoint, Outlook, Excel, Numbers, Notes",
  "career.skills.body.lang": "French (Native), English (Toeic 970)",
  "career.quali.title": "Human qualities",
  "career.quali.body": "My qualities in a working environment",
  "career.quali.body.1": "Objective vision",
  "career.quali.body.2": "Sharing of ideas",
  "career.quali.body.3": "Cold-blooded",
  "career.quali.body.4": "Adaptation skills",
  "career.quali.body.5": "Lone worker & Team worker",
  "career.quali.body.6": "Curiosity",
  "career.lang.title": "What about programming ?",
  "career.lang.body": "The levels represent my ease with the corresponding technology",
  "career.lang.body.1": "Java (+Play Framework, Spring)",
  "career.lang.body.2": "HTML/CSS/JS (+Bootstrap, jQuery)",
  "career.lang.body.3": "Golang (+Gin)",
  "career.lang.body.4": "Kotlin (+Spring)",
  "career.lang.body.5": "C# (+Unity)",
  "career.lang.body.6": "Shell (+Scripting Bash)",
  "career.lang.body.7": "PHP (+Laravel)",
  "career.lang.body.8": "C++ (+Qt)",
  "career.lang.body.9": "C (+SDL)",
  "career.exp.title": "My professional experience",
  "career.exp.eyeneed.title": "EYENEED",
  "career.exp.eyeneed.context": "ROUEN | 01/09/19 - Today",
  "career.exp.eyeneed.body": "First web developer of the <a class=\"hyperlink\" href=\"https://eyeneed.fr\" target=\"_blank\">Eyeneed</a> company in Rouen (website previously worked on by Coaxys, a development company from Mont Saint Aignan). Project management, work in full autonomy. Web development using Play Framework, a productivity framework for Java; development of crucial features of all types, and data-fetching. In charge of developers' recruitment, crisis solving, and technical support, using a support email address and processing server operations when needed. Discovery of the code reviews using Gitlab, and of SEO rules to enhance a website positioning. Creation of vector images to use on the website.",
  "career.exp.altitude.title": "ALTITUDE",
  "career.exp.altitude.context": "MONT ST AIGNAN | 04/12/18 - 31/05/19",
  "career.exp.altitude.body": "Embedded C++ development on a flying catamaran using foils. The goal was to position the foils, using the program, depending on many environment variables and two modes : manual or automatic. Travels to Corsica to mount the boat and test the program in real conditions. Decision-making in what sensors we needed to buy.",
  "career.exp.keyveo.title": "KEYVEO",
  "career.exp.keyveo.context": "ROUEN | 29/01/18 - 20/07/18",
  "career.exp.keyveo.body": "3D and VR serious games software development using Unity for Windows and Android. Exponent on Laval Virtual and IN Normandy tech events; Market study about VR and AR. Discovery of the GO language.",
  "career.exp.viaflats.title": "VIAFLATS",
  "career.exp.viaflats.context": "MAASTRICHT | 20/10/16 - 22/02/17",
  "career.exp.viaflats.body": "Development of Viaflats, a real estate website. Discovery of jQuery and creation of a system of research by criteria and an availability management system.",
  "career.exp.neoma.title": "NEOMA",
  "career.exp.neoma.context": "MONT ST AIGNAN | 16/02/16 - 13/05/16",
  "career.exp.neoma.body": "Development of the <a class=\"hyperlink\" href=\"https://wepetsitty.com\" target=\"_blank\">WePetsitty</a> marketplace in Neoma's incubator. Discovery of Laravel and Bootstrap and development of a messaging system, a payment solution and a research feature. Great customer relationship.",
  "career.exp.doqboard.title": "DOQBOARD",
  "career.exp.doqboard.context": "ROUEN | 04/05/15 - 17/07/15",
  "career.exp.doqboard.body": "C++ Development of a surgery study software, development of PHP scripts, discovery of the versioning with SVN Tortoise, and the start-up environment in general.",
  "career.exp.arkena.title": "ARKENA",
  "career.exp.arkena.context": "LOS ANGELES | 15/09/14 - 23/11/14",
  "career.exp.arkena.body": "Work on the company's platform, bash scripts development, datacenter visit, study of softwares (puppet, ansible, chef) to be acquired by the company.",

  "projects.main.title": "My personal projects",
  "projects.main.body": "This page lists my current projects or ideas. Games, apps or other things, you can all of these on this page, as well as a description for each one.",
  "projects.scridle.title": "Scridle - Work in progress",
  "projects.scridle.body": "Scridle is by far my biggest project; It is still in the lab as you read these lines but the goal here is to build a website allowing several people to write stories together in a gamified way. This \"gamified way\" is all the key behind the project and was a random thought at a random moment but a random thought which could be the beginning of a great thing. Scridle might also become a cool social network if it gains some attention once it is finished.",
  "projects.ost.title": "Ostily - 2020",
  "projects.ost.body": "<a class=\"hyperlink\" target=\"_blank\" href=\"https://www.ostily.com\">Ostily</a> is a presentation website, just like rewan.dev, but for my sister and me. This way, we each have a personal website, and a group website. Ostily was also an occasion to learn some things about the Spring framework and the Thymeleaf templating engine, as well as using the Kotlin language (which I fell in love with) and the Sass CSS preprocessor. I also had a ton of fun designing some nice animations !",
  "projects.ohp.title": "Oh Pirate ! - 2020",
  "projects.ohp.body": "<a class=\"hyperlink\" target=\"_blank\" href=\"https://www.ohpirate.com\">Oh Pirate !</a> is a website designed to present the activity of the company of the same name. Oh Pirate ! is a company selling food, drinks and icecreams on the beaches. Don't hesitate to check their website if you want to learn more !",
  "projects.rew.title": "Rewan.dev - 2019",
  "projects.rew.body": "Rewan.dev is an history of my profile, my projects and my experience. It is regularly updated. It is overall my first website and the result of a desire to have my footprint on the internet. This project benefits from a total rework in 2021 to switch the backend to the Gin Gonic framework.",

  "contact.main.title": "Contact me",
  "contact.main.body.mail": "<a class=\"hyperlink\" href=\"mailto:elb@rewan.dev\">elb@rewan.dev</a>",
  "contact.quick.title": "Quick message",
  "contact.quick.body.mail": "Your email :",
  "contact.quick.body.content": "Your message :",
  "contact.quick.body.send": "Submit",

  "shelf.main.title": "Categories",
  "shelf.main.index.title": "Index",
  "shelf.main.profile.title": "Profile",
  "shelf.main.projects.title": "Projects",
  "shelf.main.contact.title": "Contact",
  "shelf.tools.title": "Web gadgets",
  "shelf.tools.time.title": "Time Machine",
  "shelf.tools.memory.title": "Memory game",
  "shelf.secondary.title": "Secondary pages",
  "shelf.secondary.bs.title": "Bootstrap",
  "shelf.secondary.play.title": "Play Framework",
  "shelf.secondary.le.title": "Let's Encrypt",
  "shelf.secondary.gandi.title": "Gandi",
  "shelf.secondary.go.title": "Golang",
  "shelf.secondary.rouen.title": "Rouen",
  "shelf.secondary.gin.title": "Gin Gonic",
  "shelf.secondary.v2.title": "Version 2.0",

  "time.main.title": "Welcome in the Time Machine !",
  "time.main.body": "Every information on a date, instantaneously, at the exact minute. Why ? Why not ?",
  "time.tm.title": "Time Machine",
  "time.tm.body": "Enter a date, and let magic do the work ! (Conversions of past time, wiki link to the year)",
  "time.thisYear.title": "Collected data",
  "time.thisYear.body": "Click here to know everything of this year !",
  "time.years.title": "Years",
  "time.months.title": "Months",
  "time.days.title": "Days",
  "time.hours.title": "Hours",
  "time.minutes.title": "Minutes",
  "time.seconds.title": "Seconds",
  "time.input.date": "Date",
  "time.input.time": "Temps",

  "memory.main.title": "Let's play a Memory Game !",
  "memory.main.body": "You've got some moments to memorize where the Queen tiles are. Then, the tiles flip, and you have to click where you think the Queen tiles are. You can always press SPACE to refresh the game. Click the button to begin.",
  "memory.main.button": "Let's go !",
  "memory.game.end.success": "You won ! Press ENTER to continue, or ESC to reset the game",
  "memory.game.end.failed": "You lost. Press ENTER to continue, or ESC to reset the game",
  "memory.game.flash.end.success": "You succeeded ! You leveled up to difficulty {{.param}} !",
  "memory.game.flash.end.failed": "Game over. You are taken back to level {{.param}}.",
  "memory.game.flash.reset": "The game was reset to level 1.",

  "bootstrap.main.title": "Bootstrap",
  "bootstrap.main.content": "Bootstrap, developed by Twitter, is a popular open source HTML/CSS/JS Framework. Designed to be intuitive, it allows a maximal productivity to any developer who knows how to use it, not only facilitating the placement of elements on web pages but also offering a great pack of tools allowing numerous tasks' automation (Nav bar, progress bars, modals...). Bootstrap's grid system allows easy and fast management of a website's responsiveness which is crucial for any serious website nowadays. Its best asset is of course its success and its community, which allows to any developer a fast answer to any question regarding it. I am myself more of a back-end developer, and Bootstrap is my best ally in this domain : Only one framework, and it's an end to any front-end problem !",
  "gandi.main.title": "Gandi",
  "gandi.main.content": "Web hosting is a market where you have an infinity of options. If many offers are equivalent, it is important to have a reactive service in this domain, in case there would be an important server problem. Gandi is reactive, and that's why this website is hosted on Gandi.",
  "letsencrypt.main.title": "Let's Encrypt",
  "letsencrypt.main.content": "As far as web communication is concerned, the HTTPS encrypted protocol is quickly becoming the norm of the market. More secure than the use without encryption of the HTTP protocol, it however needs the acquisition of a SSL or TLS certificate allowing an authentication of the server and the data encryption. This acquisition is done via a certification authority; and Let's Encrypt offers this service for free. The HTTPS protocol being mandatory notably for .dev domains, this website is equipped with an SSL certificate.",
  "go.main.title": "Golang",
  "go.main.content": "Go, or Golang, is a programming language created by Google. It is a modern language, of which the synthax allows a greater productivity. Its qualities include better errors management and easier multi-threading. Go is extremely performant and memory efficient : It is, in consequence, often used to develop scripts or treat large operations on servers. This language allows developing all kinds of applications, including websites, on all kinds of platforms : Go is a compiled language able to create different executable files depending on the target platform. The most important detail about Go creation's history is that it was developed by Google, and first of all for Google. This language is, then, answering one of the world's largest companies's problematics, while this company didn't see an optimal solution in the other languages, and it also means it is supported by this company. However, not counting this aspect, we must recognize that Golang has a great number of qualities allowing it to be efficient in a large number of situations, but also to be easily adopted by any developer. I also personally find in it the quality, however very subjective, to be very fun to use. Go was made with simplicity in mind too, one of the main goals being to make a C-like language more accessible to beginners than C is.",
  "gin.main.title": "Gin Gonic",
  "gin.main.content": "Gin Gonic is the most popular <a class=\"hyperlink\" href=\"/about/go\">Go</a> framework. It allows easier HTTP requests', templates' and other web resources' management, and easy development of efficient REST APIs and middlewares. Since it is so popular, many projects exist adding different components to Gin, such as caching systems, loggers, configuration managers, translation systems, and numerous others. The Gin framework is notably caracterized by it's very high performances, as demonstrated by certain <a target=\"_blank\" class=\"hyperlink\" href=\"https://github.com/the-benchmarker/web-frameworks\">benchmarks</a> putting it in front of highly popular frameworks such as Symfony, Laravel, Play or Spring. Written in Go, it also adopts its many advantages.",
  "play.main.title": "Play Framework",
  "play.main.content": "Play Framework is developed by Lightbend Inc.; It is an open source web framework that allows Java and Scala lovers to use their favorite programming language to build their websites. It resembles other frameworks like Laravel, which allow to efficiently structure a project in a MVC format (Model, View, Controller) while also having access to many simplifications (for example, an automatic mapping between model objects and the database's tables) and a centralized configuration, easily accessible, and allowing a lot of customization of the entire technical solution of the website. All these simplifications allow a great gain in productivity and development pleasure with an already loved programming language !",
  "rouen.credits": "Picture credits : Herbert Frank",
  "rouen.main.title": "City of Rouen",
  "rouen.main.content": "Most of my working time I was lucky to be able to pass in Rouen, magnificent city in Normandie (Seine Maritime) crossed by the Seine : An ideal and inspiring working frame, hosting every type of companies and so an infinite learning potential. I was notably able to work at Seine Biopolis (Doqboard company, formerly CompuSurge), Seine Innopolis (Keyveo company) and the VillageByCA (Eyeneed company). Rouen has a great aura and everything here is at hand's reach, which makes it an exciting work frame, and a great place to discover new relationships. Its rich past also makes it an historic place where tourists like to travel. We can notably see here the cathedral of Notre-Dame, and the Gros-Horloge. Every year also welcomes the Saint Romain fair, a famous fair with many attractions.",

  "update.why.title": "Rework of the website - Why ?",
  "update.why.content": "This website previously used the <a class=\"hyperlink\" href=\"/about/play\">Play Framework</a> technology, version 1.5, using the Java language.<br> I had made this choice for a productivity reason : Play is a framework making very many operations easier, and object oriented programming languages seem more \"logical\" to me. Furthermore, Java is a language I love, and with which I feel at ease.<br>To finish, Play Framework was the technology I was using professionnally at this time, so this developing choice allowed me to enhance my skills on the professional side as well.<br><br>But here is the thing : Play now adopted Scala as its core programming language for its version 2. Version 1.5, using Java, is not updated anymore. I then had to modernize my website by using another framework.<br>I figured out that if I changed the framework, I might as well change the language. I was very interested in three languages I knew very little of and had just barely looked at, <a class=\"hyperlink\" href=\"/about/go\">Go</a>, Kotlin and Swift.<br>Each language was linked to at least one framework which I was also interested in : Gin for Go, Ktor and Spring for Kotlin, and Vapor for Swift.<br> I chose Go and Gin because Go was the language I was the most interested in, and because if I had chosen Kotlin I would have seen it as an opportunity to use Spring, however Spring seemed a bit heavy for a relatively light project as this one.<br>Gin has the advantage of being light, developed in Go, and extremely efficient. However, this change was implying some components' update.",
  "update.how.title": "What changed ?",
  "update.how.content": "The entirety of the code needed to be reworked, to change from Java to Go and exit the Object Oriented design.<br>Some graphical improvements; the responsive of the website was optimized.<br>URLs of numerous pages were changed to be more logical (/tech/xxx & /desc/xxx -> /about/xxx for example)<br>Added spinning icons on the index.<br>Go and Gin descriptions' pages, as well as this page, were added.<br>Configuration was externalized, and a configuration by profile management system was added.<br>Customization of the logger system, with an history of the logs.<br>Customization of 404 and 500 errors' pages. Added an unique ID, communicated to the user, on the 500 error's pages and in the logs after an error.<br>Remake of the message flashing system with the help of a struct imitating its functionnality.<br>Management of translations, with the retrieval of the accept-language HTTP header.<br>In place of using the cache, we now use a string-object mapping, managed by a concurrent thread.<br>Goroutines were added to manage the log history and the removal of old logs, as well as temporary stored variables.<br>Fix of a problem on the number of seconds in the <a class=\"hyperlink\" href=\"/tools/time\">Time Machine</a> tool, resolved when recoding the time system in Go.<br>Added the version number on the left of the footer.<br>Added social networks on the right of the footer.<br>Translation of error messages.<br>Minor changes on the <a class=\"hyperlink\" href=\"/career\">Career</a> page.<br>Fusion of the secondary pages to only one template for all these pages (Except this one).<br>UX optimized by changing the number of fields in the Time Machine tool to only use two.<br>Automatical completion of the sitemap.<br>Explanatory commenting on all the backend in the perspective of opening the source code on <a class=\"hyperlink\" target=\"_blank\" href=\"https://github.com/\">Github</a>.",

  "cookies.like": "Do you like cookies ?",
  "cookies.alert": "This website uses them to offer you the best experience.<br>While browsing this website, you consent to the use of cookies.",
  "cookies.learn": "Learn more",
  "cookies.ok": "Suits me !",

  "secondary.info.title": "More information",
  "secondary.info.website": "<a class=\"hyperlink\" target=\"_blank\" href=\"{{.param}}\">Website</a>",
  "secondary.info.wiki": "<a class=\"hyperlink\" target=\"_blank\" href=\"{{.param}}\">Wikipedia</a>",

  "sitemap.error.filewrite": "Unable to write file: {{.param}}",

  "mail.error.captcha": "Invalid captcha",
  "mail.error.connect": "Failed connecting to the Recaptcha server",
  "mail.error.notsent": "Error sending the email",
  "mail.success.sent": "Email correctly sent !",

  "cookie.error.notfound": "Cookie not found",

  "404.title": "<span class='text-info'><i class='fas fa-lg fa-exclamation-triangle'></i> Error 404 :</span> page <span class='text-info'>{{.param}}</span> not found",
  "404.content": "I worked really hard, I even tried to use <span class='text-info'>magic skills</span>, but I could not find this page. <span class='text-warning'>Sorry</span>.",
  "500.title": "<span class='text-danger'><i class='fas fa-lg fa-times-circle'></i> Error 500 :</span> The server responded the <span class='text-danger'>{{.param}}</span> error",
  "500.content": "Logged with ID : <a href='#' class='hyperlink' onClick='copyToClipboard(\"#idError\")'><i class='fas fa-clipboard'></i> <span id='idError'>{{.param}}</span></a> / Please <a class='hyperlink' target='_blank' href='/contact'>contact me</a> and tell me the ID of the error.",

  "title.index": "Erwan Le Bihan, web developer in Rouen",
  "title.career": "My developer profile",
  "title.projects": "My projects",
  "title.contact": "Contact me",
  "title.time": "Time Machine",
  "title.shelf": "The Shelf",
  "title.bootstrap": "Bootstrap",
  "title.go": "Golang",
  "title.gin": "Gin Gonic",
  "title.play": "Play Framework",
  "title.letsencrypt": "Let's Encrypt",
  "title.gandi": "Gandi",
  "title.rouen": "City of Rouen",
  "title.memory": "Memory game",
  "title.version": "Version 2.0 - Website rework",
  "title.404": "Page not found",
  "title.500": "Server error",

  "meta.desc": "Personal website of Erwan Le Bihan, engeneer and developer located in Rouen, France."
}