{
  "main.title": "Bienvenue sur mon site internet !",
  "main.body": "Bienvenue sur <a class=hyperlink href=\".\">rewan.dev</a>. Ce site est mon espace virtuel en ligne, où je peux consigner mon <a class=hyperlink href=\"/career\">profil</a> de développeur, mes <a class=hyperlink href=\"/projects\">projets</a> personnels, et les informations nécessaires pour <a class=hyperlink href=\"/contact\">me contacter</a>. Vous pouvez accéder respectivement à ces trois catégories via les icônes de la barre de navigation ci-dessus.<br>Ce site est optimisé pour formats ordinateur, tablette et mobile, et est disponible en Anglais et en Français.<br>Plus d'informations sur ce serveur sont disponibles dans la catégorie \"à propos de ce site\".",
  "me": "À propos de moi",
  "me.more": "Plus d'informations <a class=\"hyperlink\" href=\"/career\">ici</a>.",
  "website.title": "À propos de ce site",
  "website.body": "Ce site utilise les langages HTML5/CSS3 et JavaScript grâce au framework <a class=\"hyperlink\" href=\"/about/bootstrap\">Bootstrap 4</a> ainsi que le langage <a class=\"hyperlink\" href=\"/about/go\">Go</a> et une architecture au format MVC sous le framework <a class=\"hyperlink\" href=\"/about/gin\">Gin Gonic</a> qui permet une gestion simplifiée des requêtes HTTP.<br>Auparavant, le site utilisait Java et <a class=\"hyperlink\" href=\"/about/play\">Play! framework</a> en version 1.5 > <a class=\"hyperlink\" href=\"/about/2.0\">Pourquoi ce changement ?</a><br> Le certificat SSL permettant le protocole HTTPS a été fourni par <a class=\"hyperlink\" href=\"/about/letsencrypt\">Let's Encrypt</a>.<br>L'hébergement du domaine et de la machine Debian est fourni par <a class=\"hyperlink\" href=\"/about/gandi\">Gandi</a>.",

  "career.main.title": "Qui suis-je ?",
  "career.main.body": "Bonjour ! Je m'appelle Erwan Le Bihan, <a class=\"hyperlink\" href=\"../tools/time\">j'ai {{.param}} ans</a> et je suis ingénieur développeur en informatique mais un artiste avant tout. <a class=\"hyperlink\" href=\"/about/rouen\">J'habite à Rouen</a>, et je suis passionné par la technologie et l'art depuis l'enfance et notamment par la création de jeux vidéos, même si j'ai récemment acquis un intérêt certain pour le développement d'applications et de sites web. Je considère la programmation comme un art à part entière et je souhaite avant tout m'amuser dans mon travail - Ma philosophie est de toujours écouter mon cœur dans mes choix professionnels et mes projets personnels.",
  "career.skills.legend.os": "Familier aux systèmes principaux",
  "career.skills.legend.formats": "Je développe pour tous les formats",
  "career.skills.legend.present": "Mes champs de compétence, par catégorie :",
  "career.skills.title": "Mes compétences",
  "career.skills.body.ide": "IntelliJ, Unity, Eclipse, Visual Studio, Sublime Text, Nano",
  "career.skills.body.db": "SQL, MySQL, MongoDB, PHPMyAdmin, Access, SQL Server",
  "career.skills.body.git": "Git, Github, GitLab, BitBucket, GitKraken, SourceTree, Working Copy",
  "career.skills.body.pm": "Méthodes Agiles, Trello, Project, Ganttproject, OBS/WBS, Mind Mapping, UML, Monday",
  "career.skills.body.design": "Aseprite, Inkscape, MagicaVoxel (Pixel / Voxel et Vector art)",
  "career.skills.body.desk": "LaTeX, Word, PowerPoint, Outlook, Excel, Numbers, Notes",
  "career.skills.body.lang": "Français (Natale), Anglais (Toeic 970)",
  "career.quali.title": "Qualités humaines",
  "career.quali.body": "Voici mes principales qualités en entreprise",
  "career.quali.body.1": "Vision objective",
  "career.quali.body.2": "Force de proposition",
  "career.quali.body.3": "Sang froid",
  "career.quali.body.4": "Capacité d'adaptation",
  "career.quali.body.5": "Autonomie",
  "career.quali.body.6": "Curiosité",
  "career.lang.title": "Et la programmation ?",
  "career.lang.body": "Les niveaux représentés ici symbolisent l'aisance avec les différents langages",
  "career.lang.body.1": "Java (+Play Framework, Spring)",
  "career.lang.body.2": "HTML/CSS/JS (+Bootstrap, jQuery)",
  "career.lang.body.3": "Golang (+Gin)",
  "career.lang.body.4": "Kotlin (+Spring)",
  "career.lang.body.5": "C# (+Unity)",
  "career.lang.body.6": "Shell (+Scripting Bash)",
  "career.lang.body.7": "PHP (+Laravel)",
  "career.lang.body.8": "C++ (+Qt)",
  "career.lang.body.9": "C (+SDL)",
  "career.exp.title": "Mon expérience professionnelle",
  "career.exp.eyeneed.title": "EYENEED",
  "career.exp.eyeneed.context": "ROUEN | 01/09/19 - Aujourd'hui",
  "career.exp.eyeneed.body": "Premier développeur de l'entreprise <a class=\"hyperlink\" href=\"https://eyeneed.fr\" target=\"_blank\">Eyeneed</a> (Travaillant sur un site web auparavant développé par Coaxys, une entreprise de développement prestataire de Mont Saint Aignan). Gestion de projet, travail en autonomie totale. Développement web avec Play !, un framework de productivité utilisant le langage Java; développement de fonctionnalités cruciales de tous types, et récupération de données pour les statistiques de l'entreprise. En charge du recrutement dans l'équipe de développeurs, de la résolution de crises, et du support technique via une adresse mail de support et des opérations sur le site ou le serveur si besoin. Découverte des revues de code via Gitlab, et de règles SEO pour améliorer le positionnement d'un site sur Google. Création d'images vectorielles pour l'utilisation sur le site.",
  "career.exp.altitude.title": "ALTITUDE",
  "career.exp.altitude.context": "MONT ST AIGNAN | 04/12/18 - 31/05/19",
  "career.exp.altitude.body": "Développement C++ embarqué sur un catamaran volant à foils. Le but était de positionner les foils via le programme, selon les variables environnementales récupérées par des capteurs, et deux modes: Manuel et automatique. Voyages en Corse pour monter le bateau et procéder aux tests en conditions réelles; prises de décision pour l'achat de capteurs.",
  "career.exp.keyveo.title": "KEYVEO",
  "career.exp.keyveo.context": "ROUEN | 29/01/18 - 20/07/18",
  "career.exp.keyveo.body": "Développement sur Unity, en 3D et en VR, sur Windows et Android, d'applications et serious games. Exposant sur les salons Laval Virtual et IN Normandy, étude de marché et découverte du langage GO.",
  "career.exp.viaflats.title": "VIAFLATS",
  "career.exp.viaflats.context": "MAASTRICHT | 20/10/16 - 22/02/17",
  "career.exp.viaflats.body": "Création d'un site internet de location immobilière, découverte de jQuery et création d'un système de recherche avancée selon critères ainsi qu'un système de gestion des heures de disponibilité hebdomadaires.",
  "career.exp.neoma.title": "NEOMA",
  "career.exp.neoma.context": "MONT ST AIGNAN | 16/02/16 - 13/05/16",
  "career.exp.neoma.body": "Développement de la marketplace <a class=\"hyperlink\" href=\"https://wepetsitty.com\" target=\"_blank\">WePetsitty</a> au sein de l'incubateur de Neoma. Apprentissage de Laravel et de Bootstrap, développement d'un système de messagerie, de paiement et de recherche. Relation client permanente.",
  "career.exp.doqboard.title": "DOQBOARD",
  "career.exp.doqboard.context": "ROUEN | 04/05/15 - 17/07/15",
  "career.exp.doqboard.body": "Développement en C++ d'une application dans le domaine des études chirurgicales, développement de scripts PHP, découverte du versioning et de nombreux outils, ainsi que du travail en start-up",
  "career.exp.arkena.title": "ARKENA",
  "career.exp.arkena.context": "LOS ANGELES | 15/09/14 - 23/11/14",
  "career.exp.arkena.body": "Travaux sur la plateforme de l'entreprise, développement de scripts bash, visite de datacenter, étude des logiciels Puppet, Ansible et Chef dans le cadre d'une acquisition par l'entreprise.",

  "projects.main.title": "Mes projets personnels",
  "projects.main.body": "Cette page recense mes projets en cours ou encore au stade d'idées. Qu'il s'agisse de jeux, d'applications ou autres, vous pourrez trouver ces projets sur cette page, ainsi qu'un descriptif pour chacun.",
  "projects.scridle.title": "Scridle - Travail en cours",
  "projects.scridle.body": "Scridle est de loin mon plus grand projet. Il est toujours dans le laboratoire tandis que vous lisez ces lignes, mais le but est de créer un site web permettant à plusieurs personnes d'écrire ensemble des histoires de manière gamifiée. Cette façon \"gamifiée\" est la raison d'être du projet, et était à la base une idée aléatoire apparue à un moment aléatoire, mais pouvant éventuellement être le début de grandes choses. Scridle pourrait également devenir un bon réseau social s'il gagne une bonne attention à sa sortie.",
  "projects.ost.title": "Ostily - 2020",
  "projects.ost.body": "<a class=\"hyperlink\" target=\"_blank\" href=\"https://www.ostily.com\">Ostily</a> est un site web de présentation, semblable à rewan.dev, mais il s'agit d'un site commun pour ma sœur et moi. De cette façon, nous avons chacun un site personnel, plus un site de groupe. Ostily était également une occasion d'apprendre un peu le framework Spring, le moteur de template Thymeleaf, le préprocesseur CSS Sass, et surtout le langage Kotlin (Dont je suis tombé amoureux). Je me suis également beaucoup amusé à créer des animations diverses !",
  "projects.ohp.title": "Oh Pirate ! - 2020",
  "projects.ohp.body": "<a class=\"hyperlink\" target=\"_blank\" href=\"https://www.ohpirate.com\">Oh Pirate !</a> est un site web de présentation d'une activité : celle d'Oh Pirate !, une entreprise vendant des beignets, des boissons et des glaces sur les plages. Pour en apprendre plus, n'hésitez pas à visiter leur site !",
  "projects.rew.title": "Rewan.dev - 2019",
  "projects.rew.body": "Rewan.dev, c'est mon environnement numérique personnalisé, et un historique de mes projets et idées. C'est aussi le résultat d'une envie : Celle de créer un site web avec, comme seule base, l'hébergement d'un nom de domaine et d'une machine Debian. Ce projet bénéficie d'une refonte totale en 2021 pour passer au framework Gin Gonic.",

  "contact.main.title": "Me contacter",
  "contact.main.body.mail": "<a class=\"hyperlink\" href=\"mailto:elb@rewan.dev\">elb@rewan.dev</a>",
  "contact.quick.title": "Message rapide",
  "contact.quick.body.mail": "Votre email :",
  "contact.quick.body.content": "Votre message :",
  "contact.quick.body.send": "Envoyer",

  "pages.main.title": "Catégories",
  "pages.main.index.title": "Index",
  "pages.main.profile.title": "Profil",
  "pages.main.projects.title": "Projets",
  "pages.main.contact.title": "Contact",
  "pages.tools.title": "Gadgets web",
  "pages.tools.time.title": "Time Machine",
  "pages.tools.memory.title": "Le Jeu de la reine",
  "pages.secondary.title": "Pages secondaires",
  "pages.secondary.bs.title": "Bootstrap",
  "pages.secondary.play.title": "Play Framework",
  "pages.secondary.le.title": "Let's Encrypt",
  "pages.secondary.gandi.title": "Gandi",
  "pages.secondary.go.title": "Golang",
  "pages.secondary.rouen.title": "Rouen",
  "pages.secondary.gin.title": "Gin Gonic",
  "pages.secondary.v2.title": "Version 2.0",

  "time.main.title": "Bienvenue dans la Time Machine !",
  "time.main.body": "Toutes les infos en un minimum de temps sur une date, à l'heure voire la minute près. Pourquoi ? Pourquoi pas ?",
  "time.tm.title": "Time Machine",
  "time.tm.body": "Entrez une date, et laissez la magie faire le travail ! (Conversions du temps passé, lien wiki vers l'année)",
  "time.thisYear.title": "Données recueillies",
  "time.thisYear.body": "Cliquez ici pour tout savoir sur cette année !",
  "time.years.title": "Années",
  "time.months.title": "Mois",
  "time.days.title": "Jours",
  "time.hours.title": "Heures",
  "time.minutes.title": "Minutes",
  "time.seconds.title": "Secondes",
  "time.input.date": "Date",
  "time.input.time": "Temps",

  "memory.main.title": "Jouons à un jeu de mémoire !",
  "memory.main.body": "Vous avez quelques instants pour mémoriser où sont les reines. Ensuite, les cases sont retournées, et il faut retrouver les reines en sélectionnant les cases. Vous pouvez rafraîchir la page avec la touche ESPACE. Cliquez sur le bouton pour démarrer la partie.",
  "memory.main.button": "Allez !",
  "memory.game.end.success": "Vous avez réussi ! Appuyez sur ENTREE pour continuer, ou ESC pour redémarrer le jeu",
  "memory.game.end.failed": "Vous avez perdu. Appuyez sur ENTREE pour continuer, ou ESC pour redémarrer le jeu",
  "memory.game.flash.end.success": "Vous avez réussi ! Vous passez au niveau {{.param}} !",
  "memory.game.flash.end.failed": "Vous avez perdu. Vous pouvez recommencer le niveau {{.param}}.",
  "memory.game.flash.reset": "Le jeu a été réinitialisé au niveau 1.",

  "bootstrap.main.title": "Bootstrap",
  "bootstrap.main.content": "Bootstrap, développé par Twitter, est un framework HTML/CSS open source très populaire. Intuitif, il permet une productivité maximale à tout développeur web sachant l'utiliser, facilitant non seulement le placement des éléments sur les pages mais offrant également un grand pack d'outils permettant d'automatiser nombre de tâches (Barre de navigation, barres de progrès, modales...). Le système de grille de Bootstrap permet en outre de gérer facilement et rapidement le côté responsive d'un site internet, ce qui aujourd'hui est indispensable à un site qui se veut compatible. Son meilleur atout est bien sûr son succès et donc sa communauté, qui permet à tout développeur de trouver rapidement réponse à ses questions. Je suis moi-même plutôt un développeur back-end, et Bootstrap est mon meilleur allié dans ce domaine : Un seul framework, et plus aucun problème en front !",
  "gandi.main.title": "Gandi",
  "gandi.main.content": "En terme d'hébergement web, il y a beaucoup de choix sur le marché. Si beaucoup de prestations se valent, il est important d'avoir un service réactif dans ce domaine au cas où un problème surviendrait avec le serveur. Gandi possède cette réactivité, c'est pourquoi ce site est hébergé par Gandi Cloud.",
  "letsencrypt.main.title": "Let's Encrypt",
  "letsencrypt.main.content": "On tend aujourd'hui vers une généralisation du chiffrement HTTPS en terme de protocole de communication web. Plus sécurisé que l'utilisation sans chiffrement du HTTP, ce protocole nécessite en revanche l'acquisition d'un certificat SSL ou TLS permettant l'authentification du serveur et le chiffrement des données. Cette acquisition se fait auprès d'une autorité de certification; et Let's Encrypt fournit gratuitement ce service. Le protocole HTTPS étant notamment obligatoire pour les sites en .dev, le serveur web ici présent est équipé de cette technologie.",
  "go.main.title": "Golang",
  "go.main.content": "Go ou Golang est un langage de programmation créé par Google. C'est un langage moderne, dont la synthaxe permet une productivité accrue. Ses qualités comportent une gestion optimisée des erreurs et une création simplifiée de processus concurrents. Go est extrêmement performant et prend peu de place en mémoire : Il est donc souvent utilisé pour des scripts et des traitements complexes sur les serveurs. Ce langage permet de développer tout type d'application, dont des sites web, pour toutes les plateformes : Go est un langagé compilé pouvant créer un exécutable différent selon la plateforme cible. Le détail le plus important de l'histoire de la création de Go est qu'il a été développé par Google, et avant tout pour Google. Le langage répond donc aux problématiques d'une des plus grandes entreprises au monde, qui ne voyait pas une solution optimale dans les autres langages, et est soutenu par cette même entreprise. Toutefois, même sans prendre en compte cet aspect, il faut reconnaître que le Golang possède un grand nombre de qualités qui lui permettent d'être efficace dans de très nombreuses situations, mais aussi d'être facilement adopté par n'importe quel développeur. Je lui trouve également la qualité, toutefois très subjective, d'être agréable à utiliser. Go a été créé avec la simplicité à l'esprit, l'un des objectifs principaux étant de développer un langage comme le C, mais plus accessible aux développeurs débutants.",
  "gin.main.title": "Gin Gonic",
  "gin.main.content": "Gin Gonic est le framework web <a class=\"hyperlink\" href=\"/about/go\">Go</a> le plus populaire. Il permet de gérer plus facilement les requêtes HTTP, les templates et nombre d'autres ressources essentielles à un site web, et de créer facilement et efficacement des API REST performantes et des middlewares. De par sa popularité, de nombreux projets permettent également d'ajouter des composants à Gin, comme par exemple des systèmes de caching, des loggers, des gestionnaires de configuration, des systèmes de traduction et nombre d'autres. Le framework Gin est caractérisé notamment par de très importantes performances, comme démontré par certains <a target=\"_blank\" class=\"hyperlink\" href=\"https://github.com/the-benchmarker/web-frameworks\">benchmarks</a> qui le classent devant des frameworks reconnus tels que Symfony, Laravel, Play ou Spring. Écrit en Go, il en adopte également les nombreux avantages.",
  "play.main.title": "Play Framework",
  "play.main.content": "Play  Framework est développé par Lightbend Inc.; Il s'agit d'un framework web open source qui permet aux amoureux de Java ou de Scala d'utiliser leur langage préféré pour créer leurs sites web. Il s'apparente à d'autres frameworks web tels que Laravel, qui permettent de découper efficacement l'architecture d'un projet en format MVC (Modèles, Vues, Contrôleurs) tout en profitant de simplifications dans nombre de domaines (Par exemple le mapping entre les modèles dans le code et les tables de la base de données se fait automatiquement) et d'une configuration centralisée, facilement accessible, qui permet une bonne personnalisation de toute la solution technique du site web. Toutes ces simplifications permettent de gagner en productivité, et de prendre plus de plaisir à développer avec un langage qu'on aimait déjà !",
  "rouen.credits": "Crédits photo : Herbert Frank",
  "rouen.main.title": "Ville de Rouen",
  "rouen.main.content": "J'ai eu la chance de pouvoir passer la plupart de mon temps de travail à Rouen, magnifique ville de Normandie (Seine Maritime) traversée par la Seine : Un cadre de travail idéal et inspirant, abritant des sociétés de tous les milieux et donc un potentiel d'apprentissage infini. J'ai notamment pu travailler à Seine Biopolis (Société Doqboard, anciennement CompuSurge), Seine Innopolis (Société Keyveo) et au VillageByCA (Société Eyeneed). La ville de Rouen possède une aura agréable et toutes les commodités sont toujours à portée de main, ce qui en fait un lieu de travail passionnant ainsi qu'une ville provoquant des rencontres de qualité. Son passé riche en fait également un lieu historique où les touristes aiment voyager. On peut notamment y trouver la cathédrale Notre-Dame de Rouen, ainsi que le Gros-Horloge. Chaque année s'y tient la foire Saint-Romain, célèbre fête foraine regroupant nombre d'attractions.",

  "update.why.title": "Refonte du site - Pourquoi ?",
  "update.why.content": "Ce site web utilisait auparavant la technologie <a class=\"hyperlink\" href=\"/about/play\">Play Framework</a> en version 1.5, avec le langage Java. <br> J'avais fait ce choix pour une raison de productivité : Play est un framework qui simplifie de très nombreuses opérations, et les langages de programmation orientés objet me semblent plus \"logiques\". De plus Java est un langage que j'aime beaucoup et avec lequel je me sens à l'aise.<br>Pour finir, Play Framework était la technologie que j'utilisais professionnellement donc ce choix de développement me permettait de m'améliorer de ce côté là également.<br><br>Seulement voilà, Play est désormais un framework qui a adopté Scala pour langage en version 2. La version 1.5, qui utilise Java, n'est plus mise à jour. Il fallait donc que je modernise mon site en changeant de framework.<br>Quitte à changer de framework, je souhaitais également changer de langage. J'étais très intéressé par trois langages que je ne connaissais pas beaucoup et avais seulement survolé, <a class=\"hyperlink\" href=\"/about/go\">Go</a>, Kotlin et Swift.<br>Chaque langage était lié à au moins un framework qui m'intéressait : Gin pour Go, Ktor et Spring pour Kotlin, et Vapor pour Swift.<br>J'ai choisi Go et Gin parce que Go était le langage qui m'intéressait le plus, et parce que j'aurais profité de Kotlin pour utiliser Spring, or Spring me semblait un peu lourd pour un projet de cette envergure.<br>Gin possède l'avantage d'être léger, développé en Go et extrêmement performant. En revanche ce changement allait nécessiter des mises à jour sur certains composants.",
  "update.how.title": "Quels changements ?",
  "update.how.content": "Tout le code existant a nécessité une refonte, pour passer de Java à Go et sortir du paradigme objet.<br>Améliorations graphiques; Le responsive du site web a été optimisé.<br>Les URL des pages ont changé pour être plus logiques (/tech/xxx & /desc/xxx -> /about/xxx par exemple)<br>Des icônes animées ont été ajoutées sur la page d'accueil.<br>Les pages de description de Go, Gin ainsi que cette page ont été ajoutées.<br>La configuration a été externalisée et un système de gestion de configuration par profil a été mis en place.<br>Personnalisation du système de logger avec historique des logs.<br>Personnalisation des pages d'erreur 404 et 500. Ajout d'un ID unique communiqué à l'utilisateur sur les pages d'erreur 500 et loggé après chaque erreur.<br>Imitation du système de flashing de messages grâce à une struct qui permet d'en imiter le fonctionnement.<br>Ajout d'un système de gestion de la traduction, grâce à la récupération du header HTTP accept-language.<br>A la place de l'utilisation du cache, on utilise désormais un mapping entre string et objet géré par un processus concurrent.<br>Mise en place de goroutines pour gérer la mise en historique et l'effacement des logs ainsi que la gestion des variables stockées temporairement.<br>Correction d'un problème sur le nombre de secondes dans l'outil <a class=\"hyperlink\" href=\"/tools/time\">Time Machine</a>, problème disparu lors du recodage de la fonctionnalité en Go.<br>Ajout du numéro de version à gauche du footer.<br>Ajout des réseaux sociaux à droite du footer.<br>Traduction des messages d'erreur.<br>Changements mineurs sur la page <a class=\"hyperlink\" href=\"/career\">Career</a>.<br>Mutualisation des pages secondaires avec un seul template pour toutes les pages (sauf celle-ci)<br>Optimisation UX en changeant les champs de l'outil Time Machine pour avoir seulement deux champs à remplir.<br>Remplissage automatique du sitemap.<br>Commentaires explicatifs de tout le backend en vue d'une ouverture du code source sur <a class=\"hyperlink\" target=\"_blank\" href=\"https://github.com/\">Github</a>",

  "cookies.like": "Vous aimez les cookies ?",
  "cookies.alert": "Ce site internet les utilise afin de vous assurer la meilleure expérience possible.<br>En naviguant sur ce site, vous consentez à l'utilisation des cookies.",
  "cookies.learn": "En savoir plus",
  "cookies.ok": "Ça me va !",

  "secondary.info.title": "Plus d'informations",
  "secondary.info.website": "<a class=\"hyperlink\" target=\"_blank\" href=\"{{.param}}\">Site web</a>",
  "secondary.info.wiki": "<a class=\"hyperlink\" target=\"_blank\" href=\"{{.param}}\">Wikipedia</a>",

  "sitemap.error.filewrite": "Impossible d'écrire le fichier : {{.param}}",

  "mail.error.captcha": "Captcha non complété",
  "mail.error.connect": "Connexion au service Recaptcha échouée",
  "mail.error.notsent": "Erreur lors de l'envoi de mail",
  "mail.success.sent": "Email envoyé avec succès !",

  "cookie.error.notfound": "Cookie non trouvé",

  "500": "Erreur 500 : Erreur serveur. Sauvegardée avec l'identifiant : {{.param}}",


  "404.title": "<span class='text-info'><i class='fas fa-lg fa-exclamation-triangle'></i> Erreur 404 :</span> page <span class='text-info'>{{.param}}</span> introuvable",
  "404.content": "J'y ai mis mon cœur, j'y ai mis mes tripes, j'ai même essayé mes <span class='text-info'>pouvoirs magiques</span>, mais je ne puis trouver cette page. <span class='text-warning'>Désolé</span>.",
  "500.title": "<span class='text-danger'><i class='fas fa-lg fa-times-circle'></i> Erreur 500 :</span> Le serveur a renvoyé l'erreur <span class='text-danger'>{{.param}}</span>",
  "500.content": "Enregistrée sous l'identifiant : <a href='#' class='hyperlink' onClick='copyToClipboard(\"#idError\")'><i class='fas fa-clipboard'></i> <span id='idError'>{{.param}}</span></a> / Je vous prie de <a class='hyperlink' target='_blank' href='/contact'>me contacter</a> pour me partager cet ID.",

  "title.index": "Erwan Le Bihan, développeur web à Rouen",
  "title.career": "Profil",
  "title.projects": "Projets",
  "title.contact": "Contact",
  "title.time": "Time Machine",
  "title.pages": "Pages",
  "title.bootstrap": "Bootstrap",
  "title.go": "Golang",
  "title.gin": "Gin Gonic",
  "title.play": "Play Framework",
  "title.letsencrypt": "Let's Encrypt",
  "title.gandi": "Gandi",
  "title.rouen": "Ville de Rouen",
  "title.memory": "Jeu de Mémoire",
  "title.version": "Version 2.0 - Refonte du site",
  "title.404": "Page introuvable",
  "title.500": "Erreur serveur",

  "meta.desc": "Site web personnel de Erwan Le Bihan, ingénieur développeur basé à Rouen."
}